The Girl in the Glass Case (Paperback)- Devashish Sardana
Author - Devashish Sardana
Seller - Book Hound
INR 250.00 INR 149.00 40% Off

Category: Horror, Newly Added
ADDITIONAL INFORMATION 
Publisher  :  Penguin Random House India (10 January 2022); Penguin Random House India
Language  :  English
Paperback  :  344 pages
ISBN-10  :  0143454374
ISBN-13  :  978-0143454373
Item Weight  :  227 g
Dimensions  :  12.9 x 2.29 x 19.81 cm
DESCRIPTION 
Simone Singh is a feisty IPS officer who would rather spend her days locking up criminals than apologizing for her lack of social skills. Freshly back from an unjust suspension, Simone is forced to team up with DSP Zoya Bharucha, an empathetic officer who's as loved in the police force as Simone is shunned.


The Canterville Ghost - by Oscar Wilde
Author - NA
Seller - Book Hound
INR 75.00 INR 69.00 8% Off

Category: 99 Store, Horror, Action & Adventure, Fiction

ADDITIONAL INFORMATION 
DESCRIPTION 
Item Weight : 130 g Mass Market : 130 pages ISBN-13 : 978-0380703077 Dimensions : 11.18 x 2.29 x 18.03 cm Publisher : Language: : English Condition : New

From Blood and Ash (Paperback) -Jennifer L Armentrout
Author - Jennifer L Armentrout
Seller - Book Hound
INR 1600.00 INR 1168.00 27% Off

Category: Romance, Horror, Newly Added
ADDITIONAL INFORMATION 
DESCRIPTION 
Publisher  :  Blue Box Press (13 January 2022) Language  :  English Paperback  :  494 pages ISBN-10  :  1952457769 ISBN-13  :  978-1952457760 Item Weight  :  717 g Dimensions  :  15.24 x 3.15 x 22.86 cm Captivating and action-packed, From Blood and Ash is a sexy, addictive, and unexpected fantasy perfect for fans of Sarah J. Maas and Laura Thalassa. A Maiden... Chosen from birth to usher in a new era, Poppy's life has never been her own


Dracula – by Bram Stoker -
Author - NA
Seller - Book Hound
INR 199.00 INR 159.00 20% Off

Category: Horror
Item Weight : 310 g : 368 pages ISBN-10 : 9788172344771 ISBN-13 : 978-8172344771 Dimensions : 20 x 14 x 4 cm Reading level : 19 and up Publisher : Publishing; First edition (1 January 2013) ASIN : 8172344775 Language: : English Condition: New



HISTORY

The Discovery of India by Jawaharlal Nehru (Paperback)
Author - NA
Seller - Book Hound
INR 699.00 INR 349.00 50% Off

Category: Indian Writing, Indian History, Non-Fiction
DESCRIPTION 
Publisher: Penguin India; New edition (1 February 2008) Language: English : 656 pages ISBN-10: 0143031031 ISBN-13: 978-0143031031 Item Weight: 710 g Dimensions: 23.6 x 4.8 x 16.1 cm Country of Origin: India Generic Name: Books Condition: New -- Jawaharlal Nehru wrote the book ‘The Discovery of India’, during his imprisonment at Ahmednagar fort for participating in the Quit India Movement (1942 – 1946). 

My Experiments with Truth (Paperback) - Mahatma Gandhi
Author - 99BooksStore
Seller - Book Hound
INR 150.00 INR 125.00 17% Off

Category: Bestseller Books, Indian Writing, Indian History, Self-Help


The India Way (Paperback) - S. Jaishankar
Author - S. Jaishankar
Seller - Book Hound
INR 499.00 INR 219.00 56% Off

Category: Bestseller Books, Indian History
ADDITIONAL INFORMATION 
DESCRIPTION 
Publisher  :  HarperCollins India (18 May 2022) Language  :  English Paperback  :  248 pages ISBN-10  :  9394407219 ISBN-13  :  978-9394407213 Item Weight  :  260 g The global order is always evolving, and in that sense, change could well be seen as a constant factor. But that ongoing evolution has now been given a sharper edge by the impact of the coronavirus pandemic, developments in Afghanistan, the Ukraine conflict and greater friction among key powers. 'One Trend and Four Shocks' are thus creating a new landscape. The 'Four Shocks' have, each in their own way, led to heightened global anxiety and insecurity.


Dharma: Decoding the Epics for a Meaningful Life (Paperback) - Amish
Author - 99BooksStore
Seller - Book Hound
INR 399.00 INR 179.00 55% Off

Category: Bestseller Books, Indian Writing, Indian History


Childern

How the Sea Became Salty - Sudha Murty
Author - Sudha Murty
Seller - Book Hound
INR 195.00 0% Off

Category: Children, Indian Writing
ADDITIONAL INFORMATION 
DESCRIPTION 
Publisher  :  Puffin (3 July 2019) Language  :  English Paperback  :  40 pages ISBN-10  :  0143451405 ISBN-13  :  978-0143447047 Reading age  :  5 - 8 years Item Weight  :  68 g Dimensions  :  12.7 x 0.25 x 20.32 cm Country of Origin  :  India Condition : New A long, long time ago, seawater was sweet and drinkable. How it became salty is a remarkable story. India's favourite storyteller brings alive this timeless tale with her inimitable wit and simplicity. Dotted with charming illustrations, this gorgeous chapter book is the ideal introduction for beginners to the world of Sudha Murty.


The Magic Drum and Other Favourite Stories - Sudha Murty
Author - Sudha Murty
Seller - Book Hound
INR 250.00 INR 139.00 44% Off

Category: Children, Indian Writing, Fiction
Publisher : Penguin Books Limited; Latest edition (1 January 2015) Language: : English : 160 pages ISBN-10 : 0143333631 Reading age : 9 - 12 years Item Weight : 160 g Dimensions : 20 x 14 x 4 cm Country of Origin : India Condition : New --About the Author/ class="a-section a-spacing-small a-padding-small is the chairperson of the Infosys Foundation in India. She has a master's degree in electrical engineering from the Indian Institute of Science, Bangalore. She started her career as a development engineer and has also taught computer science at Bangalore University colleges. is a prolific writer in Kannada and English. She is a columnist for English and Kannada dailies with twenty-nine books and 200 titles to her credit. Her books have been translated into all major Indian languages. She has been honoured with various awards for her philanthropic and literary efforts. She has also received the Padma Shri from the Government of India as well as seven honorary doctorates from universities in India.


Peter Pan – by J. M. Barrie -
Author - NA
Seller - Book Hound
INR 175.00 INR 149.00 15% Off

Category: Children, Teen Fiction
  Item Weight : 150 g Country of Origin : India ISBN-10 : 9386538377 : 168 pages ISBN-13 : 978-9386538376 Dimensions : 20 x 14 x 4 cm Publisher : ! Publishing (8 February 2018) Language: : English Condition ; New


  FAMOUS FIVE: 18:Five on Finniston Farm (Paperback) - Enid Blyton
Author - Enid Blyton
Seller - Book Hound
ISBN - 9780340894712
INR 199.00 INR 89.00 55% Off

Category: Children
Publisher  :  Hodder Children's Books; First Edition (15 July 2004) Language  :  English Paperback  :  224 pages ISBN-10  :  0340894717 ISBN-13  :  978-0340894712 Reading age  :  15 years and up Item Weight  :  120 g Dimensions  :  20.3 x 25.4 x 4.7 cm Country of Origin  :  United Kingdom The Famous Five are having a great time on holiday on Finniston Farm! They're determined to explore the ruined castle on the grounds of the farm, and uncover the mysterious old dungeons! But someone else is searching, too. Can the Five find the dungeons.




Hindi

 Secrets of the Millionaire Mind (Hindi)(Paperback)- T. Harv Eker
Author - T. Harv Eker
Seller - Book Hound
ISBN - 9788183221115
INR 299.00 INR 149.00 50% Off

Category: Newly Added, Hindi Books, Self-Help
ADDITIONAL INFORMATION 
ASIN  :  8183221114
Publisher  :  Manjul Publishing House Pvt. Ltd.; New edition (1 March 2009); Manjul Publishing House Pvt. Ltd., 2nd Floor, Usha Preet Complex, 42 Malviya Nagar, Bhopal - 462003 - India
Language  :  Hindi
Paperback  :  206 pages
ISBN-10  :  9788183221115
ISBN-13  :  978-8183221115
Item Weight  :  240 g
Dimensions  :  20.3 x 25.4 x 4.7 cm
क्या आपको कभी इस बात पर हैरानी हुर्इ है कि कुछ लोग आसानी से अमीर क्यों बन जाते हैं, जबकि बाक़ी लोग ज़िंदगी भर आर्थिक मुश्किलों में फँसे रहते हैं? क्या यह अंतर उनकी शिक्षा, बुद्धि, योग्यताओं, टाइमिंग, काम की आदतों, संपर्कों, क़िस्मत या नौकरी, बिज़नेस अथवा निवेश के चुनाव के कारण होता है? अचंभित कर देने वाला जवाब है : इनमें से किसी कारण नहीं! अपनी ज़बर्दस्त पुस्तक सीक्रेट्स ऑफ़ द मिलियनेअर माइंड में टी. हार्व एकर यह दावा करते हैं कि “पाँच मिनट में मैं बता सकता हूँ कि भविष्य में आपके पास कितनी दौलत होगी!” एकर आपके “धन और सफलता के ब्लूप्रिटं” को पहचानकर यह काम करते हैं। हम सभी के अवचेतन मन में धन का व्यक्तिगत ब्लूप्रिटं होता है और हमारे वित्तीय जीवन पर सबसे ज़्यादा प्रभाव इसी का पड़ता है।


Godan – Hindi Edition by Premchand-
Author - Hindi Books
Seller - Book Hound
INR 195.00 INR 115.00 41% Off

Category: Hindi Books
Publisher :  Language: : Hindi : 360 pages ISBN-13 : 978-9380703985 Reading level : 10 years and up Item Weight : 450 g Dimensions : 20 x 14 x 4 cm Country of Origin : India


(The Power Of Your Subconscious Mind in -Hindi) (Paperback) - Joseph Murphy
Author - Hindi Books
Seller - Book Hound
INR 499.00 INR 89.00 82% Off

Category: Hindi Books
Publisher : Diamond Pocket Books Private Limited; First edition (1 January 2020) Language : Hindi : 240 pages ISBN-10 : 9352619641 ISBN-13 : 978-9352619641 Item Weight : 281 g Condition : New --यह पुस्तक मस्तिष्क की आधारभूत सच्चाइयों को आसान भाषा में समझाने की कोशिश है। जीवन और मस्तिष्क के आधारभूत नियमों को रोजमर्रा की सरल भाषा में समझाना पूरी तरह संभव है।मनुष्य दुखी क्यों होता है? दूसरा खुश क्यों होता है? एक मनुष्य सुखी और समृद्ध क्यों होता है? दूसरा गरीब और दुखी क्यों होता है? एक मनुष्य भयभीत और तनावग्रस्त क्यों होता है? दूसरा आस्थावान तथा आत्मविश्वासी क्यों होता है? एक मनुष्य के पास सुंदर, आलीशान बंगला क्यों होता है? दूसरा झोपड़ी में क्यों रहता है? एक मनुष्य बहुत सफल और दूसरा बुरी तरह असफल क्यों होता है? क्या आपके चेतन और अवचेतन मन में इन प्रश्नों का कोई उत्तर मिल सकता है? निश्चित रूप से मिल सकता है । इस पुस्तक का अध्ययन करने और इसमें बताई तकनीक को अमल में लाने से आप उस चमत्कारिक शक्ति को जान लेंगे, जो आपको दुविधा, दुख, उदासी और असफलता के कुचक्र से बाहर निकलने में मदद करेगी। यह चमत्कारिक शक्ति आपको मंजिल तक पहुँचने में मदद देगी, आपकी समस्याएँ सुलझाएगी, आपको मानसिक और शारीरिक बेड़ियों से स्वतंत्र करेगी। यह आपको पुनः स्वस्थ, उत्साही और शक्तिशाली बना सकती है। जब आप अपनी आंतरिक शक्तियों का प्रयोग करना सीख लेंगे, तो आप भय की कैद से स्वतंत्र हो जाएँगे और सुखमय जीवन का आनंद लेंगे।


Ruthi Rani – Hindi Edition by Premchand-
Author - Hindi Books
Seller - Book Hound
INR 150.00 INR 99.00 34% Off

Category: Hindi Books

Publisher :  Language: : Hindi ISBN-13 : 978-9380703992 Reading level : 10 years and up Item Weight : 200 g Dimensions : 20 x 14 x 4 cm Country of Origin : India



Raavan (Hindi) (PAPER BACK)-AMISH TRIPATHI
Author - AMISH TRIPATHI
Seller - Book Hound
ISBN - 9789388754361
INR 399.00 INR 199.00 50% Off

Category: Hindi Books, Other 